#pragma once

namespace squares {

    float vertices[] = {
        // координаты     
        0.5f,  0.5f, 0.0f,
        0.5f, -0.5f, 0.0f,
       -0.5f, -0.5f, 0.0f,
       -0.5f,  0.5f, 0.0f,
    };
    float colors[] = {
       // цвета           
       1.0f, 0.0f, 0.0f,  
       0.0f, 1.0f, 0.0f,  
       0.0f, 0.0f, 1.0f,  
       1.0f, 1.0f, 0.0f,  
    };
    float texures[] = {
       // текстурные координаты
       1.0f, 1.0f,   // верхн€€ права€
       1.0f, 0.0f,   // нижн€€ права€
       0.0f, 0.0f,   // нижн€€ лева€
       0.0f, 1.0f    // верхн€€ лева€ 
    };


}


namespace Shapes {

    float verticesSq[] = {
        // ѕервый треугольник
         0.5f,  0.5f, 0.0f,  // верхн€€ права€
         0.5f, -0.5f, 0.0f,  // нижн€€ права€
        -0.5f,  0.5f, 0.0f,  // верхн€€ лева€ 

        // ¬торой треугольник
         0.5f, -0.5f, 0.0f,  // нижн€€ права€
        -0.5f, -0.5f, 0.0f,  // нижн€€ лева€
        -0.5f,  0.5f, 0.0f   // верхн€€ лева€
    };

    float vertices2[] = {

       // ѕервый треугольник
        0.5f,  0.5f, 0.0f,  // верхн€€ права€
        0.5f, -0.5f, 0.0f,  // нижн€€ права€
        -0.5f,  0.5f, 0.0f,  // верхн€€ лева€ 

        // ¬торой треугольник
         0.5f, -0.5f, 0.0f,  // нижн€€ права€
         -0.5f, -0.5f, 0.0f,  // нижн€€ лева€
         -0.5f,  0.5f, 0.0f   // верхн€€ лева€
   };

    float texCoordsNew[4] = {
        1.0f, 1.0f,  // lower-left corner  
        -1.0f, -1.0f,  // lower-right corner
    };


    GLfloat points[9] = {
            0.0f,0.5f,0.0f,
            -0.5f,-0.5f,0.0f,
            0.5f,-0.5f,0.0f,
    };
    GLfloat colors[9] = {
        1.0f,0.f,0.f,
        0.0f,1.f,0.f,
        0.0f,0.f,1.f
    };
    float texCoords[6] = {
        0.0f, 0.0f,  // lower-left corner  
        1.0f, 0.0f,  // lower-right corner
        0.5f, 1.0f   // top-center corner
    };

    float vertices[] = {
        -0.5f, -0.5f, -0.5f,  0.0f, 0.0f,
         0.5f, -0.5f, -0.5f,  1.0f, 0.0f,
         0.5f,  0.5f, -0.5f,  1.0f, 1.0f,
         0.5f,  0.5f, -0.5f,  1.0f, 1.0f,
        -0.5f,  0.5f, -0.5f,  0.0f, 1.0f,
        -0.5f, -0.5f, -0.5f,  0.0f, 0.0f,

        -0.5f, -0.5f,  0.5f,  0.0f, 0.0f,
         0.5f, -0.5f,  0.5f,  1.0f, 0.0f,
         0.5f,  0.5f,  0.5f,  1.0f, 1.0f,
         0.5f,  0.5f,  0.5f,  1.0f, 1.0f,
        -0.5f,  0.5f,  0.5f,  0.0f, 1.0f,
        -0.5f, -0.5f,  0.5f,  0.0f, 0.0f,

        -0.5f,  0.5f,  0.5f,  1.0f, 0.0f,
        -0.5f,  0.5f, -0.5f,  1.0f, 1.0f,
        -0.5f, -0.5f, -0.5f,  0.0f, 1.0f,
        -0.5f, -0.5f, -0.5f,  0.0f, 1.0f,
        -0.5f, -0.5f,  0.5f,  0.0f, 0.0f,
        -0.5f,  0.5f,  0.5f,  1.0f, 0.0f,

         0.5f,  0.5f,  0.5f,  1.0f, 0.0f,
         0.5f,  0.5f, -0.5f,  1.0f, 1.0f,
         0.5f, -0.5f, -0.5f,  0.0f, 1.0f,
         0.5f, -0.5f, -0.5f,  0.0f, 1.0f,
         0.5f, -0.5f,  0.5f,  0.0f, 0.0f,
         0.5f,  0.5f,  0.5f,  1.0f, 0.0f,

        -0.5f, -0.5f, -0.5f,  0.0f, 1.0f,
         0.5f, -0.5f, -0.5f,  1.0f, 1.0f,
         0.5f, -0.5f,  0.5f,  1.0f, 0.0f,
         0.5f, -0.5f,  0.5f,  1.0f, 0.0f,
        -0.5f, -0.5f,  0.5f,  0.0f, 0.0f,
        -0.5f, -0.5f, -0.5f,  0.0f, 1.0f,

        -0.5f,  0.5f, -0.5f,  0.0f, 1.0f,
         0.5f,  0.5f, -0.5f,  1.0f, 1.0f,
         0.5f,  0.5f,  0.5f,  1.0f, 0.0f,
         0.5f,  0.5f,  0.5f,  1.0f, 0.0f,
        -0.5f,  0.5f,  0.5f,  0.0f, 0.0f,
        -0.5f,  0.5f, -0.5f,  0.0f, 1.0f
    };

    unsigned int indices[] = {
        0, 1, 3, // первый треугольник
        1, 2, 3  // второй треугольник
    };

}